# تعريف دالة اسمها convert مهمتها تحويل الرموز النصية إلى إيموجي
def convert(text):
    # نأخذ النص ونستبدل الابتسامة والحزن، ثم نخزن النتيجة في متغير جديد
    new_text = text.replace(":)", "🙂").replace(":(", "🙁")
    # إرجاع النص المعدل ليتم استخدامه في مكان آخر
    return new_text

# تعريف الدالة الأساسية للبرنامج
def main():
    # طلب مدخلات (نص) من المستخدم
    user_input = input()
    # إرسال ما كتبه المستخدم لدالة convert وتخزين النتيجة في result
    result = convert(user_input)
    # طباعة النتيجة النهائية للمستخدم
    print(result)

# مناداة الدالة الأساسية ليبدأ البرنامج بالعمل فعلياً
main()
